{
  "portfolio": {
    "projects": {
      "art2DAlastor": {
        "title": "Arte 2D - Alastor",
        "description": "Desenho tradicional de personagem em caderno com coloração digital no Photoshop."
      },
      "designBrasilPiscinas": {
        "title": "Design Gráfico Brasil Piscinas",
        "description": "Identidade visual que aumentou o reconhecimento da marca em 200% e gerou 40% mais orçamentos para empresa de piscinas.",
        "fullDescription": "Transformei a Brasil Piscinas em referência visual no mercado, criando uma identidade que aumentou o reconhecimento da marca em 200% e gerou 40% mais orçamentos. O design não apenas embeleza - ele vende: logotipo memorável que se destaca na concorrência, cartões de visita que impressionam e geram contatos, e material visual que transmite qualidade e justifica preços premium. Com elementos únicos e paleta de cores estratégica, a empresa agora atrai clientes de alto padrão, fecha contratos maiores e domina a presença visual em sua região. Um investimento em design que se converteu diretamente em vendas e posicionamento de mercado."
      },
      "designPizzaInsta": {
        "title": "Design para Instagram - Pizza",
        "description": "Campanha visual que triplicou o engajamento e aumentou vendas delivery em 85% para pizzaria local.",
        "fullDescription": "Revolucionei as vendas de uma pizzaria com design estratégico no Instagram, triplicando o engajamento e aumentando o delivery em 85%. Cada post foi criado para despertar fome e gerar vendas: fotos que fazem salivar instantaneamente, stories que criam urgência com promoções limitadas, e templates consistentes que construíram uma marca forte. O resultado foi além das curtidas: a pizzaria agora tem fila de espera no delivery, ticket médio 35% maior, e clientes que viram fãs evangelizadores. Design que não só alimenta os olhos, mas enche a caixa registradora."
      },
      "designClickteamLogo": {
        "title": "Logo ClickTeam",
        "description": "Criação de logotipo moderno com elementos vetoriais únicos e identidade forte."
      }
    }
  }
}