{
  "portfolio": {
    "projects": {
      "rezerveBarber": {
        "title": "Rezerve — Sistema de Agendamento Omnichannel para Barbearias",
        "description": "Sistema completo de agendamento via WhatsApp para barbearias com APIs PHP, MySQL, n8n e integração de pagamentos.",
        "fullDescription": "Desenvolvi um sistema de agendamento omnichannel para barbearias, integrado ao WhatsApp via Evolution API e orquestrado por n8n, com APIs PHP e banco MySQL. O destaque é a versão Enterprise do workflow, que detecta automaticamente o domínio e usa variáveis de ambiente (.env), tornando o deploy portável. O backend implementa endpoints REST para listar profissionais por serviço, consultar horários disponíveis e criar agendamentos com validação, segurança e transações. O banco inclui carteira financeira (receitas/comissões), saques, planos de assinatura e logs. O sistema permite que clientes agendem serviços diretamente pelo WhatsApp, escolhendo profissional, data e horário, com confirmação automatizada e opções de pagamento via Mercado Pago."
      },
      "lexcheck": {
        "title": "LexCheck — Verificação e Enriquecimento de Citações Jurídicas",
        "description": "Sistema web em FastAPI para revisar documentos (PDF/DOCX/TXT), detectar e padronizar citações legais, verificar no LexML e gerar relatórios PDF/Excel.",
        "fullDescription": "O LexCheck acelera a conferência de citações jurídicas em documentos. Desenvolvido com FastAPI (Python), UI leve em Jinja2 e processamento de arquivos com PyPDF2 e python-docx, o sistema detecta, normaliza e verifica referências legais em uma base local (SQLite) e na API pública do LexML. Gera relatórios executivos em PDF (ReportLab) e Excel (OpenPyXL), com operação 100% local por padrão (LGPD) e distribuição via PyInstaller para Windows. Inclui limites de tamanho/extensão, diretórios temporários, endpoints REST e logs." 
      },
      "assistenteVendasIA": {
        "title": "Assistente de Vendas com IA - CRM com WhatsApp",
        "description": "Sistema completo de CRM com integração WhatsApp, IA para atendimento automatizado e gestão de leads para empresa de transporte.",
        "fullDescription": "Desenvolvi um sistema completo de CRM com integração WhatsApp e IA conversacional para automatizar o atendimento e gestão de leads de uma transportadora. O backend foi construído com FastAPI, PostgreSQL 16+ e SQLAlchemy 2.0, com suporte a operações assíncronas. A integração com WhatsApp foi feita via Z-API, permitindo respostas automáticas usando GPT-4.1 da OpenAI. O sistema processa cotações automaticamente, qualifica leads e oferece um dashboard completo com métricas em tempo real. O frontend foi desenvolvido com Next.js 15.4+, TypeScript e React 19, oferecendo uma interface moderna e responsiva. A arquitetura é escalável, usando Docker e Google Cloud Run para o backend e Vercel para o frontend."
      },
      "itamir": {
        "title": "Juristask - Sistema de Gestão Jurídica SaaS",
        "description": "Desenvolvi o Juristask, um sistema SaaS completo para gestão jurídica, com arquitetura multi-tenant moderna, backend robusto em FastAPI e frontend em React 19 + TypeScript. Solução pronta para produção, altamente personalizável e repleta de recursos avançados para escritórios de advocacia.",
        "fullDescription": "O Juristask é um sistema de gestão jurídica SaaS desenvolvido com arquitetura multi-tenant, garantindo isolamento total entre clientes (tenant_id). O backend utiliza FastAPI com mais de 40 endpoints REST, autenticação JWT com MFA, PostgreSQL 15 (25+ tabelas) e Alembic para migrações, Redis para cache e sessões, integração com Stripe, RBAC para controle de permissões, módulos completos para clientes, processos, audiências, tarefas, calendário, documentos e financeiro, middleware PCI-compliant, logging estruturado e monitoramento. O frontend foi construído com React 19, TypeScript, Vite, TailwindCSS 4, React Query, mais de 60 componentes reutilizáveis, dashboard em tempo real, notificações toast, validação com Zod e suporte a modo claro/escuro. Entre os diferenciais estão personalização white-label, geração dinâmica de PDFs, OCR, captura de dados via RSS/API, integração com Google Calendar e modelos de petições. O sistema está pronto para produção, com Docker, testes automatizados e documentação completa."
      },
      "leve-saude-web": {
        "title": "Leve Saúde - Teste Web",
        "description": "Teste para empresa de saúde, com foco em conversão e experiência do usuário.",
        "fullDescription": "Teste desenvolvido com React 19 e TypeScript, apresentando serviços de saúde de forma atrativa. Design responsivo com Tailwind CSS 4.0 e animações suaves para destacar os diferenciais da empresa."
      },
      "sistemaSolar3D": {
        "title": "Sistema Solar 3D",
        "description": "Modelagem 3D completa do sistema solar com animações realistas e detalhes astronômicos."
      },
      "flyservDrones": {
        "title": "FlyServ Drones - Site Corporativo",
        "description": "Website moderno para empresa de drones com foco em conversão e experiência do usuário.",
        "fullDescription": "Site corporativo desenvolvido com React 19 e TypeScript, apresentando serviços de drones de forma atrativa. Design responsivo com Tailwind CSS 4.0 e animações suaves para destacar os diferenciais da empresa."
      },
      "portfolio": {
        "title": "Portfólio Pessoal – Jeferson Reis Almeida",
        "description": "Site pessoal construído com Next.js 15, React 19 e Tailwind 4, com animações suaves, i18n e foco em performance, acessibilidade e SEO.",
        "fullDescription": "Este portfólio foi projetado para apresentar minha jornada, projetos e habilidades com uma experiência moderna e performática. Construído com Next.js 15, React 19 e TypeScript, utiliza Tailwind CSS 4 para estilização, Framer Motion para microinterações, e next-i18next para internacionalização (pt/en). O projeto inclui otimizações de SEO, métricas com Vercel Analytics, imagens otimizadas, lazy loading, dark mode, e uma arquitetura de componentes acessível e reutilizável. O foco é demonstrar boas práticas de frontend, DX e qualidade de código, com CI de linting e formatação (ESLint + Prettier)."
      },
      "ricardodias": {
        "title": "Ricardo Dias",
        "description": "website para um cliente, professor de artes",
        "fullDescription": "Site pessoal desenvolvido com React e TypeScript, apresentando projetos de forma atrativa. Design responsivo com Tailwind CSS e animações suaves para destacar as habilidades do desenvolvedor."
      },
      "meushop": {
        "title": "MeuShop - E-commerce",
        "description": "E-commerce desenvolvido com React e TypeScript, apresentando produtos de forma atrativa. Design responsivo com Tailwind CSS e animações suaves para destacar as habilidades do desenvolvedor."
      },
      "organizadorweb": {
        "title": "Organizador Web",
        "description": "Organizador Web desenvolvido com React e TypeScript, apresentando produtos de forma atrativa. Design responsivo com Tailwind CSS e animações suaves para destacar as habilidades do desenvolvedor."
      },
      "chatbot": {
        "title": "Chatbot",
        "description": "Chatbot desenvolvido com React e TypeScript, apresentando produtos de forma atrativa. Design responsivo com Tailwind CSS e animações suaves para destacar as habilidades do desenvolvedor."
      },
      "jogo-plataforma": {
        "title": "Jogo Plataforma",
        "description": "Jogo Plataforma desenvolvido com React e TypeScript, apresentando produtos de forma atrativa. Design responsivo com Tailwind CSS e animações suaves para destacar as habilidades do desenvolvedor."
      },
      "menu-interativo": {
        "title": "Menu Interativo",
        "description": "Menu Interativo desenvolvido com React e TypeScript, apresentando produtos de forma atrativa. Design responsivo com Tailwind CSS e animações suaves para destacar as habilidades do desenvolvedor."
      }
    }
  }
}
