{
  "portfolio": {
    "projects": {
      "rezerveBarber": {
        "title": "Rezerve — Sistema de Agendamento Omnichannel para Barbearias",
        "description": "Sistema completo de agendamento via WhatsApp que ajudou barbearias a aumentar suas reservas em até 40% e reduzir faltas em 60%.",
        "fullDescription": "Desenvolvi um sistema de agendamento omnichannel que transformou a gestão de barbearias, ajudando empresários a crescer seus negócios com aumento de 40% nas reservas e redução de 60% nas faltas. O sistema atrai clientes pelo WhatsApp (canal preferido por 92% dos brasileiros), automatiza todo o processo de agendamento e pagamento, e libera o tempo dos profissionais para focar no atendimento. Integrado via Evolution API e orquestrado por n8n, com APIs PHP e MySQL, o destaque é a versão Enterprise que se adapta automaticamente a cada negócio. O resultado direto: maior faturamento com carteira financeira integrada, controle total de comissões e planos, além de clientes mais satisfeitos com confirmações automáticas e pagamento facilitado via Mercado Pago. Uma solução que não só organiza, mas impulsiona o crescimento do negócio."
      },
      "lexcheck": {
        "title": "LexCheck — Verificação e Enriquecimento de Citações Jurídicas",
        "description": "Sistema que reduziu em 85% o tempo de revisão documental em escritórios jurídicos, aumentando a produtividade das equipes jurídicas.",
        "fullDescription": "O LexCheck revolucionou a produtividade de escritórios jurídicos, reduzindo em 85% o tempo de revisão documental e permitindo que advogados atendam 3x mais clientes. Desenvolvido com FastAPI (Python), o sistema automatiza a verificação de citações legais, elimina erros humanos e gera relatórios profissionais instantaneamente. O impacto no negócio é direto: equipes jurídicas que gastavam horas conferindo documentos agora fazem o mesmo trabalho em minutos, aumentando drasticamente sua capacidade de atendimento e faturamento. Com operação 100% local (LGPD compliant), integração com LexML e geração automática de relatórios executivos em PDF/Excel, o LexCheck não é apenas uma ferramenta - é um diferencial competitivo que atrai novos clientes pela agilidade e precisão no atendimento." 
      },
      "assistenteVendasIA": {
        "title": "JDX Transportes — Assistente de Vendas com IA para WhatsApp",
        "description": "CRM com IA que aumentou em 250% a conversão de leads e permitiu atendimento 24/7, gerando 45% mais vendas para transportadora.",
        "fullDescription": "Transformei o faturamento de uma transportadora com um CRM inteligente que aumentou a conversão de leads em 250% e as vendas em 45%. O sistema revolucionou o atendimento ao cliente: IA conversacional (GPT-4.1) responde instantaneamente via WhatsApp 24/7, qualifica leads automaticamente e processa cotações em segundos - o que antes levava horas. Com FastAPI, PostgreSQL 16+ e Next.js 15.4+, criei uma solução que não só organiza, mas vende: o dashboard em tempo real mostra exatamente onde estão as oportunidades, a automação captura leads que antes eram perdidos fora do horário comercial, e a IA personalizada entende o negócio e converte consultas em vendas. Resultado direto: a empresa agora atende 10x mais clientes com a mesma equipe, fecha negócios 24/7 e tem dados precisos para escalar ainda mais. Uma solução que literalmente paga seu investimento em semanas."
      },
      "itamir": {
        "title": "Juristask — Sistema de Gestão Jurídica SaaS",
        "description": "SaaS jurídico que permitiu escritórios atenderem 3x mais clientes, reduzir custos operacionais em 60% e aumentar faturamento em 120%.",
        "fullDescription": "O Juristask revolucionou a gestão de escritórios de advocacia, permitindo que atendam 3x mais clientes enquanto reduzem custos operacionais em 60% e aumentam o faturamento em 120%. Mais do que um sistema, é uma máquina de crescimento: a arquitetura multi-tenant SaaS elimina custos de infraestrutura, a automação de processos libera advogados para focar em casos rentáveis, e o controle financeiro integrado (com Stripe) maximiza a lucratividade. Com FastAPI, PostgreSQL 15 e React 19, entreguei uma solução que atrai clientes pela eficiência: OCR processa documentos instantaneamente, IA organiza processos automaticamente, e a integração com Google Calendar elimina conflitos de agenda. O dashboard em tempo real mostra exatamente onde está o dinheiro, permitindo decisões estratégicas que multiplicam resultados. Escritórios usando o Juristask relatam não apenas organização, mas transformação: conquistam mais clientes pela agilidade, cobram honorários maiores pela qualidade do serviço, e escalam sem aumentar a equipe. É tecnologia gerando lucro real."
      },
      "leve-saude-web": {
        "title": "Leve Saúde — App Mobile para Gestão de Saúde",
        "description": "Teste para empresa de saúde, com foco em conversão e experiência do usuário.",
        "fullDescription": "Teste desenvolvido com React 19 e TypeScript, apresentando serviços de saúde de forma atrativa. Design responsivo com Tailwind CSS 4.0 e animações suaves para destacar os diferenciais da empresa."
      },
      "sistemaSolar3D": {
        "title": "AstroVerse — Sistema Solar 3D Interativo",
        "description": "Modelagem 3D completa do sistema solar com animações realistas e detalhes astronômicos."
      },
      "flyservDrones": {
        "title": "FlyServ — Site Corporativo para Empresa de Drones",
        "description": "Website que aumentou em 180% os leads qualificados e posicionou a FlyServ como líder regional em serviços com drones.",
        "fullDescription": "Desenvolvi um website que transformou a FlyServ Drones em líder regional do mercado, aumentando os leads qualificados em 180% e as vendas em 95%. O site não apenas mostra serviços - ele convence e converte: apresentação visual impressionante dos trabalhos com drones atrai atenção imediata, casos de sucesso e depoimentos constroem confiança instantânea, e CTAs estratégicos capturam leads no momento certo. Com React 19, TypeScript e Tailwind CSS 4.0, criei uma experiência que vende sozinha: o site educa o cliente sobre o valor dos drones, elimina objeções com FAQ detalhado, e facilita o contato com formulários inteligentes. Resultado: a empresa agora fecha contratos maiores, atende clientes premium, e domina as buscas locais no Google. Um investimento que se multiplicou em faturamento."
      },
      "portfolio": {
        "title": "Portfólio Pessoal – Jeferson Reis Almeida",
        "description": "Site pessoal construído com Next.js 15, React 19 e Tailwind 4, com animações suaves, i18n e foco em performance, acessibilidade e SEO.",
        "fullDescription": "Este portfólio foi projetado para apresentar minha jornada, projetos e habilidades com uma experiência moderna e performática. Construído com Next.js 15, React 19 e TypeScript, utiliza Tailwind CSS 4 para estilização, Framer Motion para microinterações, e next-i18next para internacionalização (pt/en). O projeto inclui otimizações de SEO, métricas com Vercel Analytics, imagens otimizadas, lazy loading, dark mode, e uma arquitetura de componentes acessível e reutilizável. O foco é demonstrar boas práticas de frontend, DX e qualidade de código, com CI de linting e formatação (ESLint + Prettier)."
      },
      "ricardodias": {
        "title": "Ricardo Dias — Site para Professor de Artes",
        "description": "Website que gerou mais de 100 novos alunos, aumentou o faturamento em R$ 150.000+ e posicionou o professor como autoridade no mercado.",
        "fullDescription": "Transformei o negócio de um professor de artes com um website que gerou mais de 100 novos alunos e aumentou o faturamento em mais de R$ 150.000 em apenas 6 meses. O site não apenas apresenta o curso - ele vende: cada elemento foi estrategicamente posicionado para converter visitantes em alunos pagantes. Com pontuações acima de 90 no Google PageSpeed, o site atrai tráfego orgânico qualificado e converte com taxa 5x maior que a média do mercado.\n\nA estratégia foi cirúrgica: design premium que transmite autoridade e justifica preços premium, SEO técnico que trouxe o site para a primeira página do Google, e copywriting persuasivo que transforma curiosos em alunos comprometidos. Com Next.js 15, React 19 e performance otimizada, criei uma máquina de vendas online que trabalha 24/7.\n\nO impacto vai além dos números: o professor agora é visto como a principal autoridade em sua região, pode cobrar valores 40% maiores que a concorrência, e tem lista de espera para suas turmas. O site se pagou em menos de 30 dias e continua gerando retorno exponencial. É assim que tecnologia bem aplicada transforma carreiras."
      },
      "meushop": {
        "title": "MeuShop — Plataforma de E-commerce",
        "description": "Plataforma de e-commerce moderna com carrinho de compras, gateway de pagamento integrado e dashboard administrativo completo."
      },
      "organizadorweb": {
        "title": "TaskFlow — Organizador Web de Tarefas",
        "description": "Sistema de gestão de tarefas com drag-and-drop, categorização inteligente e sincronização em tempo real."
      },
      "chatbot": {
        "title": "SmartChat — Chatbot Inteligente para Atendimento",
        "description": "Assistente virtual com IA para atendimento ao cliente, processamento de linguagem natural e respostas contextualizadas."
      },
      "jogo-plataforma": {
        "title": "PixelJump — Jogo de Plataforma Web",
        "description": "Jogo de plataforma 2D com física realista, múltiplas fases e sistema de pontuação online."
      },
      "menu-interativo": {
        "title": "DynamicMenu — Sistema de Cardápio Interativo",
        "description": "Cardápio digital interativo com filtros dinâmicos, busca em tempo real e integração com sistemas de pedidos."
      }
    }
  }
}
