{
  "portfolio": {
    "projects": {
      "art2DAlastor": {
        "title": "2D Art - Alastor",
        "description": "Traditional character drawing on sketchbook with digital coloring in Photoshop."
      },
      "designBrasilPiscinas": {
        "title": "Brazil Pools Graphic Design",
        "description": "Visual identity that increased brand recognition by 200% and generated 40% more quotes for pool company.",
        "fullDescription": "I transformed Brazil Pools into a visual reference in the market, creating an identity that increased brand recognition by 200% and generated 40% more quotes. The design doesn't just beautify - it sells: memorable logo that stands out from competitors, business cards that impress and generate contacts, and visual material that conveys quality and justifies premium prices. With unique elements and strategic color palette, the company now attracts high-end clients, closes bigger contracts, and dominates visual presence in their region. A design investment that converted directly into sales and market positioning."
      },
      "designPizzaInsta": {
        "title": "Instagram Design - Pizza",
        "description": "Visual campaign that tripled engagement and increased delivery sales by 85% for local pizzeria.",
        "fullDescription": "I revolutionized a pizzeria's sales with strategic Instagram design, tripling engagement and increasing delivery by 85%. Each post was created to awaken hunger and generate sales: photos that make you instantly salivate, stories that create urgency with limited promotions, and consistent templates that built a strong brand. The result went beyond likes: the pizzeria now has delivery waiting lists, 35% higher average ticket, and customers who became evangelizing fans. Design that not only feeds the eyes but fills the cash register."
      },
      "designClickteamLogo": {
        "title": "ClickTeam Logo",
        "description": "Modern logo creation with unique vector elements and strong identity."
      }
    }
  }
}