{
  "portfolio": {
    "projects": {
      "ricardodias": {
        "title": "Ricardo Dias — Premium Website for Art Teacher",
        "description": "Website that generated 100+ new students, increased revenue by $40,000+, and positioned the teacher as a market authority.",
        "fullDescription": "I transformed an art teacher's business with a website that generated over 100 new students and increased revenue by more than $40,000 in just 6 months. The site doesn't just present the course - it sells: every element was strategically positioned to convert visitors into paying students. With scores above 90 on Google PageSpeed, the site attracts qualified organic traffic and converts at a rate 5x higher than the market average.\n\nThe strategy was surgical: premium design that conveys authority and justifies premium prices, technical SEO that brought the site to Google's first page, and persuasive copywriting that turns curious visitors into committed students. With Next.js 15, React 19, and optimized performance, I created an online sales machine that works 24/7.\n\nThe impact goes beyond numbers: the teacher is now seen as the leading authority in their region, can charge 40% higher rates than competitors, and has waiting lists for their classes. The site paid for itself in less than 30 days and continues generating exponential returns. This is how well-applied technology transforms careers."
      },
      "sistemaSolar3D": {
        "title": "AstroVerse — Interactive 3D Solar System",
        "description": "Complete 3D modeling of the solar system with realistic animations and astronomical details."
      },
      "rezerveBarber": {
        "title": "Rezerve — Omnichannel Scheduling System for Barbershops",
        "description": "Complete scheduling system that helped barbershops increase bookings by 40% and reduce no-shows by 60%.",
        "fullDescription": "I developed an omnichannel scheduling system that transformed barbershop management, helping entrepreneurs grow their businesses with a 40% increase in bookings and 60% reduction in no-shows. The system attracts customers through WhatsApp (preferred channel for 92% of Brazilians), automates the entire scheduling and payment process, and frees up professionals' time to focus on service. Integrated via Evolution API and orchestrated by n8n, with PHP APIs and MySQL, the highlight is the Enterprise version that automatically adapts to each business. The direct result: higher revenue with integrated financial wallet, complete control of commissions and plans, plus more satisfied customers with automatic confirmations and easy payment via Mercado Pago. A solution that not only organizes but drives business growth."
      },
      "assistenteVendasIA": {
        "title": "JDX Transportes — AI-Powered Sales Assistant for WhatsApp",
        "description": "AI-powered CRM that increased lead conversion by 250% and enabled 24/7 service, generating 45% more sales for transport company.",
        "fullDescription": "I transformed a transport company's revenue with an intelligent CRM that increased lead conversion by 250% and sales by 45%. The system revolutionized customer service: conversational AI (GPT-4.1) responds instantly via WhatsApp 24/7, automatically qualifies leads, and processes quotes in seconds - what used to take hours. With FastAPI, PostgreSQL 16+ and Next.js 15.4+, I created a solution that doesn't just organize, but sells: the real-time dashboard shows exactly where opportunities are, automation captures leads that were previously lost outside business hours, and personalized AI understands the business and converts inquiries into sales. Direct result: the company now serves 10x more customers with the same team, closes deals 24/7, and has accurate data to scale even more. A solution that literally pays for its investment in weeks."
      },
      "itamir": {
        "title": "Juristask — Legal Management SaaS System",
        "description": "Legal SaaS that enabled law firms to serve 3x more clients, reduce operational costs by 60%, and increase revenue by 120%.",
        "fullDescription": "Juristask revolutionized law firm management, enabling them to serve 3x more clients while reducing operational costs by 60% and increasing revenue by 120%. More than a system, it's a growth machine: the SaaS multi-tenant architecture eliminates infrastructure costs, process automation frees lawyers to focus on profitable cases, and integrated financial control (with Stripe) maximizes profitability. With FastAPI, PostgreSQL 15 and React 19, I delivered a solution that attracts clients through efficiency: OCR processes documents instantly, AI organizes cases automatically, and Google Calendar integration eliminates scheduling conflicts. The real-time dashboard shows exactly where the money is, enabling strategic decisions that multiply results. Firms using Juristask report not just organization, but transformation: they win more clients through agility, charge higher fees for service quality, and scale without increasing staff. It's technology generating real profit."
      },
      "flyservDrones": {
        "title": "FlyServ — Corporate Website for Drone Company",
        "description": "Website that increased qualified leads by 180% and positioned FlyServ as regional leader in drone services.",
        "fullDescription": "I developed a website that transformed FlyServ Drones into the regional market leader, increasing qualified leads by 180% and sales by 95%. The site doesn't just show services - it convinces and converts: impressive visual presentation of drone work attracts immediate attention, success cases and testimonials build instant trust, and strategic CTAs capture leads at the right moment. With React 19, TypeScript and Tailwind CSS 4.0, I created an experience that sells itself: the site educates customers about drone value, eliminates objections with detailed FAQ, and facilitates contact with smart forms. Result: the company now closes bigger contracts, serves premium clients, and dominates local Google searches. An investment that multiplied into revenue."
      },
      "ascendoflex": {
        "title": "Ascendoflex — High-Converting Landing Page",
        "description": "Conversion-optimized landing page with modern and responsive design.",
        "fullDescription": "Landing page developed with React and TypeScript, focused on high conversion. Responsive design with Styled Components and performance optimizations for better user experience."
      },
      "portfolio": {
        "title": "Personal Portfolio — Jeferson Reis Almeida",
        "description": "Personal website built with Next.js 15, React 19 and Tailwind 4, featuring smooth animations, i18n and strong focus on performance, accessibility and SEO.",
        "fullDescription": "This portfolio showcases my journey, projects and skills through a modern, high‑performance experience. Built with Next.js 15, React 19 and TypeScript, it uses Tailwind CSS 4 for styling, Framer Motion for micro‑interactions, and next‑i18next for internationalization (pt/en). The project includes SEO optimizations, metrics with Vercel Analytics, optimized images, lazy loading, dark mode, and an accessible, reusable component architecture. The goal is to demonstrate frontend best practices, strong DX and code quality with linting/formatting CI (ESLint + Prettier)."
      },
      "lexcheck": {
        "title": "LexCheck — Legal Citations Verification & Enrichment",
        "description": "System that reduced document review time by 85% in law firms, increasing legal teams' productivity.",
        "fullDescription": "LexCheck revolutionized law firm productivity, reducing document review time by 85% and allowing lawyers to serve 3x more clients. Built with FastAPI (Python), the system automates legal citation verification, eliminates human errors, and generates professional reports instantly. The business impact is direct: legal teams that spent hours checking documents now do the same work in minutes, drastically increasing their service capacity and revenue. With 100% local operation (LGPD compliant), LexML integration, and automatic generation of executive PDF/Excel reports, LexCheck is not just a tool - it's a competitive advantage that attracts new clients through speed and accuracy in service."
      },
      "meushop": {
        "title": "MeuShop — E-commerce Platform",
        "description": "Modern e-commerce platform with shopping cart, integrated payment gateway and complete admin dashboard."
      },
      "organizadorweb": {
        "title": "TaskFlow — Web Task Organizer",
        "description": "Task management system with drag-and-drop, intelligent categorization and real-time synchronization."
      },
      "chatbot": {
        "title": "SmartChat — Intelligent Customer Service Chatbot",
        "description": "AI-powered virtual assistant for customer service with natural language processing and contextualized responses."
      },
      "jogo-plataforma": {
        "title": "PixelJump — Web Platform Game",
        "description": "2D platform game with realistic physics, multiple levels and online scoring system."
      },
      "menu-interativo": {
        "title": "DynamicMenu — Interactive Menu System",
        "description": "Interactive digital menu with dynamic filters, real-time search and integration with ordering systems."
      }
    }
  }
}